espressif/esp-idf/components/esp_driver_tsens/test_apps/temperature_sensor/sdkconfig.ci.iram_safe_esp32c5
CONFIG_IDF_TARGET="esp32c5"
CONFIG_COMPILER_DUMP_RTL_FILES=y
CONFIG_TEMP_SENSOR_ISR_IRAM_SAFE=y
CONFIG_COMPILER_OPTIMIZATION_NONE=y
# silent the error check, as the error string are stored in rodata, causing RTL check failure
CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT=y
# place non-ISR FreeRTOS functions in Flash
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
